<a href="https://colab.research.google.com/github/wadegrantjacobs/mypackage/blob/master/Group2_Presentation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL Aggregating, Sorting & Basic Calculations  : Formula 1 Race
@ Group 2 EDSA 

#Table of Content:


1. Introduction 
2. Basic calculations 
3. Aggregation 
4. Grouping and sorting 
5. Conclusion 
6. References

# 1. Introduction 

SQL (Structured Query Language) is a powerful 4th generation standardized programming language that is used to manage relational databases and perform various operations on the data for extracting useful insight. The language has various useful built-in functions for data analysis. In this presentation we will focus on three important topics in SQL (i.e Aggregating, Sorting & Basic Calculations) which utilises the built in functions for data analysis. The data utilized is from a Formula 1 Race database from the years 1950 to 2017 by ChrisG and it was obtained from [Kaggle.](https://www.kaggle.com/datasets/davidcochran/formula-1-race-data-sqlite?resource=download)

## 1.1 Importing database and preparing sql environment.

To gain access to our Formula1.sqlite database and conduct the analysis we utilized the code below.

In [5]:
%load_ext sql
%sql sqlite:///Formula1.sqlite

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @Formula1.sqlite'

The various table names contatined on our Formula1.sqlite database can be obtained as follows:

In [7]:
%%sql
SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///Formula1.sqlite
Done.

[]

In exploring the use of the SQL built-in functions we focused on a few tables mentioned above in order to answer various questions of interest.



---


Second Section Here


---

Out of curiousity to see what the tables have......not part of the presentation

In [8]:
%%sql
SELECT *
FROM constructors
LIMIT 10;

 * sqlite:///Formula1.sqlite
(sqlite3.OperationalError) no such table: constructors
[SQL: SELECT *
FROM constructors
LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql
SELECT *
FROM drivers 
LIMIT 10;

 * sqlite:///Formula1.sqlite
Done.

[(1, 'hamilton', '44', 'HAM', 'Lewis', 'Hamilton', '07/01/1985', 'British', 'http://en.wikipedia.org/wiki/Lewis_Hamilton'),
 (2, 'heidfeld', '', 'HEI', 'Nick', 'Heidfeld', '10/05/1977', 'German', 'http://en.wikipedia.org/wiki/Nick_Heidfeld'),
 (3, 'rosberg', '6', 'ROS', 'Nico', 'Rosberg', '27/06/1985', 'German', 'http://en.wikipedia.org/wiki/Nico_Rosberg'),
 (4, 'alonso', '14', 'ALO', 'Fernando', 'Alonso', '29/07/1981', 'Spanish', 'http://en.wikipedia.org/wiki/Fernando_Alonso'),
 (5, 'kovalainen', '', 'KOV', 'Heikki', 'Kovalainen', '19/10/1981', 'Finnish', 'http://en.wikipedia.org/wiki/Heikki_Kovalainen'),
 (6, 'nakajima', '', 'NAK', 'Kazuki', 'Nakajima', '11/01/1985', 'Japanese', 'http://en.wikipedia.org/wiki/Kazuki_Nakajima'),
 (7, 'bourdais', '', 'BOU', 'S̩bastien', 'Bourdais', '28/02/1979', 'French', 'http://en.wikipedia.org/wiki/S%C3%A9bastien_Bourdais'),
 (8, 'raikkonen', '7', 'RAI', 'Kimi', 'R�_ikk̦nen', '17/10/1979', 'Finnish', 'http://en.wikipedia.org/wiki/Kimi_R%C3%A4ikk%C3%B6nen'),
 (9, 'kubica', '', 'KUB', 'Robert', 'Kubica', '07/12/1984', 'Polish', 'http://en.wikipedia.org/wiki/Robert_Kubica'),
 (10, 'glock', '', 'GLO', 'Timo', 'Glock', '18/03/1982', 'German', 'http://en.wikipedia.org/wiki/Timo_Glock')]

In [ ]:
%%sql
SELECT *
FROM laptimes 
LIMIT 10;

 * sqlite:///Formula1.sqlite
Done.

[(841, 20, 1, 1, '1:38.109', 98109),
 (841, 20, 2, 1, '1:33.006', 93006),
 (841, 20, 3, 1, '1:32.713', 92713),
 (841, 20, 4, 1, '1:32.803', 92803),
 (841, 20, 5, 1, '1:32.342', 92342),
 (841, 20, 6, 1, '1:32.605', 92605),
 (841, 20, 7, 1, '1:32.502', 92502),
 (841, 20, 8, 1, '1:32.537', 92537),
 (841, 20, 9, 1, '1:33.240', 93240),
 (841, 20, 10, 1, '1:32.572', 92572)]

In [ ]:
%%sql
SELECT *
FROM results 
LIMIT 10;

 * sqlite:///Formula1.sqlite
Done.

[('1', 18, 1, 1, 22, 1, 1, '1', 1, 10, 58, '34:50.6', 5690616, '39', 2, '01:27.5', 218.3, 1),
 ('2', 18, 2, 2, 3, 5, 2, '2', 2, 8, 58, '5.478', 5696094, '41', 3, '01:27.7', 217.586, 1),
 ('3', 18, 3, 3, 7, 7, 3, '3', 3, 6, 58, '8.163', 5698779, '41', 5, '01:28.1', 216.719, 1),
 ('4', 18, 4, 4, 5, 11, 4, '4', 4, 5, 58, '17.181', 5707797, '58', 7, '01:28.6', 215.464, 1),
 ('5', 18, 5, 1, 23, 3, 5, '5', 5, 4, 58, '18.014', 5708630, '43', 1, '01:27.4', 218.385, 1),
 ('6', 18, 6, 3, 8, 13, 6, '6', 6, 3, 57, '', '', '50', 14, '01:29.6', 212.974, 11),
 ('7', 18, 7, 5, 14, 17, 7, '7', 7, 2, 55, '', '', '22', 12, '01:29.5', 213.224, 5),
 ('8', 18, 8, 6, 1, 15, 8, '8', 8, 1, 53, '', '', '20', 4, '01:27.9', 217.18, 5),
 ('9', 18, 9, 2, 4, 2, '', 'R', 9, 0, 47, '', '', '15', 9, '01:28.8', 215.1, 4),
 ('10', 18, 10, 7, 12, 18, '', 'R', 10, 0, 43, '', '', '23', 13, '01:29.6', 213.166, 3)]

In [ ]:
%%sql
SELECT *
FROM status 
LIMIT 10;

 * sqlite:///Formula1.sqlite
Done.

[(1, 'Finished'),
 (2, 'Disqualified'),
 (3, 'Accident'),
 (4, 'Collision'),
 (5, 'Engine'),
 (6, 'Gearbox'),
 (7, 'Transmission'),
 (8, 'Clutch'),
 (9, 'Hydraulics'),
 (10, 'Electrical')]

In [ ]:
%%sql
SELECT *
FROM qualifying
LIMIT 10;

 * sqlite:///Formula1.sqlite
Done.

[(1, 18, 1, 1, 22, 1, '1:26.572', '1:25.187', '1:26.714'),
 (2, 18, 9, 2, 4, 2, '1:26.103', '1:25.315', '1:26.869'),
 (3, 18, 5, 1, 23, 3, '1:25.664', '1:25.452', '1:27.079'),
 (4, 18, 13, 6, 2, 4, '1:25.994', '1:25.691', '1:27.178'),
 (5, 18, 2, 2, 3, 5, '1:25.960', '1:25.518', '1:27.236'),
 (6, 18, 15, 7, 11, 6, '1:26.427', '1:26.101', '1:28.527'),
 (7, 18, 3, 3, 7, 7, '1:26.295', '1:26.059', '1:28.687'),
 (8, 18, 14, 9, 9, 8, '1:26.381', '1:26.063', '1:29.041'),
 (9, 18, 10, 7, 12, 9, '1:26.919', '1:26.164', '1:29.593'),
 (10, 18, 20, 5, 15, 10, '1:26.702', '1:25.842', 'NULL')]